{
  "id": "boeing-737-800",
  "name": "Boeing 737-800",
  "manufacturer": "Boeing",
  "variant": "737-800",
  "description": "The Boeing 737-800 is the most popular variant of the 737 Next Generation family, a short-to-medium-range narrow-body airliner. First delivered in 1998, it features CFM56-7B engines and a typical two-class configuration seating approximately 162-189 passengers. The 737-800 replaced the 737-400 and became the best-selling variant of the 737NG series with over 4,900 deliveries.",
  "dimensions": {
    "lengthMeters": 39.5,
    "wingspanMeters": 35.8,
    "heightMeters": 12.5,
    "cabinWidthMeters": 3.54
  },
  "gridBounds": {
    "minX": -36,
    "maxX": 36,
    "minY": 0,
    "maxY": 79,
    "minZ": 0,
    "maxZ": 25
  },
  "entryPosition": [0, 12, 7],
  "cockpitSeatPosition": [-1, 2, 7],
  "zones": [
    {
      "name": "Cockpit",
      "type": "Cockpit",
      "description": "The flight deck of the 737-800 features a modern glass cockpit with six large LCD displays, replacing the traditional analog instruments of earlier 737 variants. The cockpit seats two pilots and includes a full suite of avionics for CAT IIIb autoland capability.",
      "minBound": [-3, 0, 6],
      "maxBound": [3, 4, 9],
      "isExterior": false
    },
    {
      "name": "Forward Galley",
      "type": "ForwardGalley",
      "description": "The forward galley is located just aft of the cockpit bulkhead, used for meal and beverage preparation for business and forward economy class passengers.",
      "minBound": [-3, 5, 6],
      "maxBound": [3, 8, 9],
      "isExterior": false
    },
    {
      "name": "Forward Lavatory",
      "type": "ForwardLavatory",
      "description": "A single lavatory located in the forward cabin area, typically reserved for business class passengers on configured aircraft.",
      "minBound": [-3, 9, 6],
      "maxBound": [-1, 11, 9],
      "isExterior": false
    },
    {
      "name": "Forward Vestibule",
      "type": "Vestibule",
      "description": "The forward entry vestibule at door 1L/1R, the primary boarding door for passengers. Contains the forward left (1L) and forward right (1R) passenger doors.",
      "minBound": [-3, 11, 6],
      "maxBound": [3, 13, 9],
      "isExterior": false
    },
    {
      "name": "Forward Cabin Left Seats",
      "type": "SeatSection",
      "description": "Left seat section of the forward cabin in a 3-abreast configuration. Seats A, B, and C are positioned along the port side with overhead bins above. Row 1 typically offers extra legroom.",
      "minBound": [-3, 14, 6],
      "maxBound": [-1, 36, 9],
      "isExterior": false
    },
    {
      "name": "Forward Cabin Aisle",
      "type": "Aisle",
      "description": "The single aisle running through the forward cabin section, connecting the forward vestibule to the mid cabin. Passengers and crew use this narrow passage for boarding and in-flight service.",
      "minBound": [0, 14, 6],
      "maxBound": [0, 36, 9],
      "isExterior": false
    },
    {
      "name": "Forward Cabin Right Seats",
      "type": "SeatSection",
      "description": "Right seat section of the forward cabin in a 3-abreast configuration. Seats D, E, and F are positioned along the starboard side with overhead bins above.",
      "minBound": [1, 14, 6],
      "maxBound": [3, 36, 9],
      "isExterior": false
    },
    {
      "name": "Mid Cabin Left Seats",
      "type": "SeatSection",
      "description": "Left seat section of the mid cabin containing economy class seating in a 3-abreast configuration. Overwing emergency exits are located in this section, providing extra legroom in exit rows.",
      "minBound": [-3, 37, 6],
      "maxBound": [-1, 55, 9],
      "isExterior": false
    },
    {
      "name": "Mid Cabin Aisle",
      "type": "Aisle",
      "description": "The single aisle running through the mid cabin section between the overwing emergency exits. The beverage cart service typically begins from the forward or aft galley and works through this section.",
      "minBound": [0, 37, 6],
      "maxBound": [0, 55, 9],
      "isExterior": false
    },
    {
      "name": "Mid Cabin Right Seats",
      "type": "SeatSection",
      "description": "Right seat section of the mid cabin containing economy class seating in a 3-abreast configuration. Window seats in this section offer views of the wing, engine, and flight control surfaces.",
      "minBound": [1, 37, 6],
      "maxBound": [3, 55, 9],
      "isExterior": false
    },
    {
      "name": "Aft Cabin Left Seats",
      "type": "SeatSection",
      "description": "Left seat section of the aft cabin with economy class seating. Passengers here experience slightly more engine noise due to proximity to the wing-mounted CFM56 engines.",
      "minBound": [-3, 56, 6],
      "maxBound": [-1, 68, 9],
      "isExterior": false
    },
    {
      "name": "Aft Cabin Aisle",
      "type": "Aisle",
      "description": "The single aisle running through the aft cabin section, connecting the mid cabin to the aft vestibule. Aft cabin passengers are typically last to deplane.",
      "minBound": [0, 56, 6],
      "maxBound": [0, 68, 9],
      "isExterior": false
    },
    {
      "name": "Aft Cabin Right Seats",
      "type": "SeatSection",
      "description": "Right seat section of the aft cabin with economy class seating. The last few rows may have limited recline due to the rear bulkhead proximity.",
      "minBound": [1, 56, 6],
      "maxBound": [3, 68, 9],
      "isExterior": false
    },
    {
      "name": "Aft Vestibule",
      "type": "Vestibule",
      "description": "The aft entry vestibule at door 2L/2R, used for rear boarding and as an emergency exit. Contains the aft left and aft right passenger doors.",
      "minBound": [-3, 69, 6],
      "maxBound": [3, 71, 9],
      "isExterior": false
    },
    {
      "name": "Aft Galley",
      "type": "AftGalley",
      "description": "The aft galley serves the majority of economy class passengers. It is the primary galley for in-flight service on most 737-800 configurations. Located on the starboard side aft of the vestibule.",
      "minBound": [0, 72, 6],
      "maxBound": [3, 75, 9],
      "isExterior": false
    },
    {
      "name": "Aft Lavatory",
      "type": "AftLavatory",
      "description": "Two aft lavatories located on the port side behind the last row of economy seating, serving the majority of passengers in the rear cabin.",
      "minBound": [-3, 72, 6],
      "maxBound": [-1, 75, 9],
      "isExterior": false
    },
    {
      "name": "Forward Cargo Hold",
      "type": "ForwardCargoHold",
      "description": "The forward cargo hold (compartment 1) beneath the forward cabin floor, capable of holding LD3-45 containers or bulk cargo. Accessed via the forward cargo door on the starboard side of the fuselage. Temperature-controlled to protect luggage and live animals.",
      "minBound": [-2, 14, 2],
      "maxBound": [2, 30, 5],
      "isExterior": false
    },
    {
      "name": "Aft Cargo Hold",
      "type": "AftCargoHold",
      "description": "The aft cargo hold (compartment 2) beneath the aft cabin floor, providing additional containerized cargo capacity. Accessed via the aft cargo door on the starboard side. Combined with the forward hold, the 737-800 offers approximately 45 cubic meters of cargo volume.",
      "minBound": [-2, 56, 2],
      "maxBound": [2, 68, 5],
      "isExterior": false
    },
    {
      "name": "Forward Cargo Access",
      "type": "CargoAccess",
      "description": "The forward cargo access shaft connecting the cabin level to the forward cargo hold below. Used by ground crew for loading and by maintenance personnel for accessing under-floor equipment and avionics bays.",
      "minBound": [0, 8, 2],
      "maxBound": [0, 9, 6],
      "isExterior": false
    },
    {
      "name": "Nose",
      "type": "Nose",
      "description": "The nose section houses the weather radar antenna behind a radome, the nose landing gear bay, and various avionics equipment. The radome is made of fiberglass composite to allow radar signals to pass through.",
      "minBound": [-2, 0, 0],
      "maxBound": [2, 6, 6],
      "isExterior": true
    },
    {
      "name": "Forward Fuselage",
      "type": "ForwardFuselage",
      "description": "The forward lower fuselage contains the forward cargo hold (compartment 1), capable of holding LD3-45 containers or bulk cargo. It also houses avionics bays and environmental control system components.",
      "minBound": [-4, 7, 0],
      "maxBound": [4, 30, 6],
      "isExterior": true
    },
    {
      "name": "Mid Fuselage",
      "type": "MidFuselage",
      "description": "The center lower fuselage houses the wing box carry-through structure, the main landing gear wheel wells, and the center fuel tank. This is the strongest structural section of the aircraft.",
      "minBound": [-4, 31, 0],
      "maxBound": [4, 52, 6],
      "isExterior": true
    },
    {
      "name": "Aft Fuselage",
      "type": "AftFuselage",
      "description": "The aft lower fuselage contains the aft cargo hold (compartment 2) and the bulk cargo compartment. The fuselage begins to taper toward the tail cone in this section.",
      "minBound": [-4, 53, 0],
      "maxBound": [4, 70, 6],
      "isExterior": true
    },
    {
      "name": "Tail",
      "type": "Tail",
      "description": "The tail cone section houses the auxiliary power unit (APU), the tail skid, and the empennage attachment structures. The distinctive 737 tail shape is visible here.",
      "minBound": [-3, 71, 0],
      "maxBound": [3, 79, 10],
      "isExterior": true
    },
    {
      "name": "Left Wing",
      "type": "LeftWing",
      "description": "The port wing spans 17.9 meters from the fuselage centerline and contains integral fuel tanks with a combined capacity of approximately 26,020 liters. It features leading-edge slats, trailing-edge flaps, ailerons, and spoilers.",
      "minBound": [-36, 30, 4],
      "maxBound": [-4, 52, 8],
      "isExterior": true
    },
    {
      "name": "Right Wing",
      "type": "RightWing",
      "description": "The starboard wing is identical in structure to the port wing, containing integral fuel tanks and the full suite of flight control surfaces including ailerons, flaps, slats, and spoilers.",
      "minBound": [4, 30, 4],
      "maxBound": [36, 52, 8],
      "isExterior": true
    },
    {
      "name": "Left Engine",
      "type": "LeftEngine",
      "description": "The left CFM56-7B26 engine is mounted on a pylon beneath the port wing. The CFM56-7B produces 27,300 lbs of thrust and features a 61-inch fan diameter. The 737's engines are distinctively non-circular at the bottom to maintain ground clearance.",
      "minBound": [-20, 33, 1],
      "maxBound": [-12, 40, 5],
      "isExterior": true
    },
    {
      "name": "Right Engine",
      "type": "RightEngine",
      "description": "The right CFM56-7B26 engine is mounted on a pylon beneath the starboard wing, identical to the left engine. The flat-bottomed nacelle is a distinctive feature of the 737 family due to the low-slung wing design.",
      "minBound": [12, 33, 1],
      "maxBound": [20, 40, 5],
      "isExterior": true
    },
    {
      "name": "Left Main Gear",
      "type": "LeftMainGear",
      "description": "The left main landing gear is a dual-wheel unit that retracts inward into the wing root/fuselage area. Each main gear tire is rated for takeoff weights up to 174,200 lbs (79,016 kg).",
      "minBound": [-6, 38, 0],
      "maxBound": [-3, 42, 4],
      "isExterior": true
    },
    {
      "name": "Right Main Gear",
      "type": "RightMainGear",
      "description": "The right main landing gear is identical to the left unit, retracting inward into the wing root/fuselage area. The main gear supports the aircraft during taxi, takeoff, and landing.",
      "minBound": [3, 38, 0],
      "maxBound": [6, 42, 4],
      "isExterior": true
    },
    {
      "name": "Nose Gear",
      "type": "NoseGear",
      "description": "The nose landing gear is a steerable dual-wheel unit that retracts forward into the nose wheel well. It provides directional control during ground operations via the tiller or rudder pedals.",
      "minBound": [-2, 8, 0],
      "maxBound": [2, 12, 4],
      "isExterior": true
    },
    {
      "name": "Vertical Stabilizer",
      "type": "VerticalStabilizer",
      "description": "The vertical stabilizer (fin) provides directional stability and supports the rudder. The 737-800 has a 7.16m tall vertical stabilizer with a swept leading edge.",
      "minBound": [-1, 68, 10],
      "maxBound": [1, 79, 25],
      "isExterior": true
    },
    {
      "name": "Horizontal Stabilizer",
      "type": "HorizontalStabilizer",
      "description": "The horizontal stabilizer provides pitch stability and supports the elevators. It is a trimmable unit that adjusts angle of incidence for pitch trim. Span is approximately 12.7 meters.",
      "minBound": [-13, 73, 10],
      "maxBound": [13, 79, 13],
      "isExterior": true
    },
    {
      "name": "APU",
      "type": "APU",
      "description": "The Honeywell 131-9B Auxiliary Power Unit is located in the tail cone and provides electrical power and bleed air for engine starting and ground operations when main engines are not running.",
      "minBound": [-1, 77, 4],
      "maxBound": [1, 79, 7],
      "isExterior": true
    }
  ],
  "components": [
    {
      "id": "captain-yoke",
      "name": "Captain's Control Yoke",
      "category": "CockpitInstrument",
      "description": "The captain's control column and yoke, used to command pitch and roll inputs. The 737 uses a traditional yoke design rather than a sidestick.",
      "position": [-1, 2, 7],
      "interactionRadius": 1.0,
      "interactionText": "Grasp the captain's yoke. Turn left or right to command aileron deflection (roll), push forward or pull back to command elevator deflection (pitch).",
      "educationTopicIds": ["flight-controls-overview", "yoke-vs-sidestick", "fly-by-wire"]
    },
    {
      "id": "first-officer-yoke",
      "name": "First Officer's Control Yoke",
      "category": "CockpitInstrument",
      "description": "The first officer's control column and yoke, mechanically linked to the captain's yoke. Both move in unison during normal operation.",
      "position": [1, 2, 7],
      "interactionRadius": 1.0,
      "interactionText": "Grasp the first officer's yoke. It moves in sync with the captain's yoke through a mechanical linkage system.",
      "educationTopicIds": ["flight-controls-overview", "dual-control-system"]
    },
    {
      "id": "throttle-quadrant",
      "name": "Throttle Quadrant",
      "category": "CockpitInstrument",
      "description": "The center pedestal throttle quadrant with two thrust levers for the left and right CFM56-7B engines. Includes reverse thrust levers and speedbrake handle.",
      "position": [0, 3, 7],
      "interactionRadius": 1.0,
      "interactionText": "Advance the thrust levers forward to increase engine power, pull back to reduce. Lift the reverse thrust levers after landing to slow the aircraft.",
      "educationTopicIds": ["engine-thrust-management", "autothrottle-system", "cfm56-engine"]
    },
    {
      "id": "rudder-pedals",
      "name": "Rudder Pedals",
      "category": "CockpitInstrument",
      "description": "Dual rudder pedal assemblies for both pilots, controlling the rudder and nose wheel steering. Also used for differential braking during ground operations.",
      "position": [0, 1, 6],
      "interactionRadius": 1.0,
      "interactionText": "Press the left pedal to deflect the rudder left and yaw the nose left. Press the right pedal for right yaw. Toe brakes are at the top of each pedal.",
      "educationTopicIds": ["rudder-control", "yaw-damper", "crosswind-technique"]
    },
    {
      "id": "pfd",
      "name": "Primary Flight Display (PFD)",
      "category": "CockpitInstrument",
      "description": "The Primary Flight Display shows the artificial horizon, airspeed, altitude, vertical speed, heading, and flight director commands on a single integrated LCD screen.",
      "position": [-2, 1, 8],
      "interactionRadius": 1.5,
      "interactionText": "Examine the PFD showing attitude, airspeed tape, altimeter, vertical speed indicator, heading, and flight mode annunciations. This is the pilot's primary scan instrument.",
      "educationTopicIds": ["primary-flight-display", "attitude-indicator", "glass-cockpit"],
      "interactionSteps": [
        "The PFD shows the attitude indicator in the center — a blue sky over brown ground divided by the horizon line. Wings-level flight.",
        "Left side: the airspeed tape scrolls showing current speed with a magenta bug for the target speed. Speed trend vector predicts where airspeed will be in 10 seconds.",
        "Right side: the altimeter tape showing current altitude with the selected altitude bug. Barometric pressure setting is displayed below.",
        "Bottom: the heading display with the current magnetic heading and selected heading bug. Flight path vector shows where the aircraft is actually going.",
        "Top: the Flight Mode Annunciator showing active autopilot modes — speed mode, lateral mode, and vertical mode across three columns."
      ]
    },
    {
      "id": "nd",
      "name": "Navigation Display (ND)",
      "category": "CockpitInstrument",
      "description": "The Navigation Display shows a plan or map view of the aircraft's position relative to waypoints, airports, terrain, and weather. Can be set to various range and mode settings.",
      "position": [-2, 1, 7],
      "interactionRadius": 1.5,
      "interactionText": "View the navigation display showing the flight plan route, nearby airports, terrain, and weather radar returns overlaid on a moving map.",
      "educationTopicIds": ["navigation-display", "flight-planning", "weather-radar"]
    },
    {
      "id": "eicas",
      "name": "Engine Indicating and Crew Alerting System",
      "category": "CockpitInstrument",
      "description": "The upper center display showing engine parameters (N1, N2, EGT, fuel flow, oil pressure/temperature) and crew alerts. Critical for monitoring engine health.",
      "position": [0, 1, 8],
      "interactionRadius": 1.5,
      "interactionText": "Monitor engine N1 and N2 spool speeds, exhaust gas temperature, fuel flow rate, and oil pressure. Caution and warning messages appear here.",
      "educationTopicIds": ["engine-instruments", "cfm56-engine", "crew-alerting"]
    },
    {
      "id": "overhead-panel",
      "name": "Overhead Panel",
      "category": "CockpitInstrument",
      "description": "The overhead panel contains systems controls for electrical, hydraulic, pneumatic, pressurization, lighting, and fire protection systems. Organized by system with standardized switch guards.",
      "position": [0, 2, 9],
      "interactionRadius": 2.0,
      "interactionText": "Scan the overhead panel with hundreds of switches and indicators organized by aircraft system: electrical, hydraulic, fuel, air conditioning, pressurization, and more.",
      "educationTopicIds": ["aircraft-systems-overview", "electrical-system", "hydraulic-system", "pressurization"],
      "interactionSteps": [
        "Starting at the top left of the overhead panel: electrical system. The battery switch is on, generator switches are set to auto.",
        "Moving right: hydraulic system A and B pressure indicators show normal. Electric hydraulic pump switches are set to auto.",
        "Center section: air conditioning packs are on auto, pressurization is set for the destination airport elevation.",
        "Lower section: fuel system with crossfeed valve closed, fuel pump switches on. Anti-ice switches are off, awaiting conditions.",
        "Panel scan complete. All switches are in their normal positions with no amber or red caution lights illuminated."
      ]
    },
    {
      "id": "mcp",
      "name": "Mode Control Panel (MCP)",
      "category": "CockpitInstrument",
      "description": "The Mode Control Panel sits above the main instrument panel and provides the primary interface for the autopilot and autothrottle systems. Pilots set desired speed, heading, altitude, and vertical speed here.",
      "position": [0, 1, 9],
      "interactionRadius": 1.5,
      "interactionText": "Set the desired speed, heading, altitude, and vertical speed on the MCP. Engage or disengage autopilot modes including LNAV, VNAV, HDG SEL, and APP.",
      "educationTopicIds": ["autopilot-modes", "mode-control-panel", "autoflight-system"],
      "interactionSteps": [
        "The Mode Control Panel spans the glare shield. Starting from left: the course selector knob for VOR/ILS navigation.",
        "IAS/Mach speed window showing the selected airspeed. The speed intervention button below allows temporary speed overrides.",
        "Center: heading selector with the HDG SEL and LNAV buttons. LNAV follows the FMC route; HDG SEL follows the selected heading.",
        "Right side: altitude selector showing the assigned altitude. VNAV and VS buttons control vertical navigation modes.",
        "Far right: autopilot engage buttons A and B, and the autothrottle ARM switch. Disengage bar is in the normal position."
      ]
    },
    {
      "id": "fmc",
      "name": "Flight Management Computer (FMC)",
      "category": "Avionics",
      "description": "The FMC CDU (Control Display Unit) on the center pedestal allows pilots to program the flight plan, performance calculations, and navigation database queries. The 737 uses dual FMCs for redundancy.",
      "position": [0, 3, 8],
      "interactionRadius": 1.5,
      "interactionText": "Access the FMC to program routes, enter performance data, review fuel predictions, and manage the navigation database. Type on the alphanumeric keypad and select line-select keys.",
      "educationTopicIds": ["flight-management-system", "performance-calculations", "navigation-database"],
      "interactionSteps": [
        "The FMC Control Display Unit glows green on the center pedestal. The IDENT page shows aircraft type, engine type, and navigation database dates.",
        "Switch to the ROUTE page. Enter the origin and destination airports, then the flight number. The FMC accesses its navigation database to build the route.",
        "The LEGS page displays each waypoint with distances, courses, and estimated times. Review the route for accuracy.",
        "The PERF INIT page requires entry of gross weight, fuel, cruise altitude, and cost index to calculate optimal speeds and fuel predictions.",
        "Programming complete. The route appears on the Navigation Display as a magenta line from origin to destination. The FMC is ready for departure."
      ]
    },
    {
      "id": "forward-exit-door",
      "name": "Forward Left Entry Door (1L)",
      "category": "Door",
      "description": "The main boarding door located on the forward left side of the fuselage. This plug-type door swings inward and upward to open, and is equipped with an inflatable evacuation slide.",
      "position": [-3, 12, 7],
      "interactionRadius": 2.0,
      "interactionText": "Examine the forward left entry door. In normal mode, the evacuation slide is armed and will deploy automatically if the door is opened. Crew must disarm the slide before opening for normal operations.",
      "educationTopicIds": ["aircraft-doors", "evacuation-procedures", "door-mechanisms"],
      "interactionSteps": [
        "The forward left entry door is closed and sealed. The slide is armed — a gust lock holds the evacuation slide pack in the armed position.",
        "The crew disarms the slide by moving the gust lock handle to the disarmed position. A red flag disappears from the viewing window.",
        "The door handle rotates upward, releasing the latch mechanisms. The plug-type door swings inward slightly and then pivots upward into the ceiling.",
        "The door is fully open, revealing the jet bridge or airstairs. Fresh air rushes into the cabin from outside."
      ]
    },
    {
      "id": "forward-right-door",
      "name": "Forward Right Entry Door (1R)",
      "category": "Door",
      "description": "The forward right entry door, typically used for catering and service access. Identical in construction to door 1L.",
      "position": [3, 12, 7],
      "interactionRadius": 2.0,
      "interactionText": "Examine the forward right service door. This door is typically used for catering cart loading and service access rather than passenger boarding.",
      "educationTopicIds": ["aircraft-doors", "ground-operations"]
    },
    {
      "id": "aft-exit-door",
      "name": "Aft Left Entry Door (2L)",
      "category": "Door",
      "description": "The aft left entry door, used for rear boarding when dual-door boarding is employed. Equipped with an inflatable evacuation slide.",
      "position": [-3, 70, 7],
      "interactionRadius": 2.0,
      "interactionText": "Examine the aft left entry door. This door enables dual-boarding operations to speed up passenger loading and unloading.",
      "educationTopicIds": ["aircraft-doors", "evacuation-procedures"]
    },
    {
      "id": "overwing-exit-left",
      "name": "Left Overwing Emergency Exit",
      "category": "Door",
      "description": "The left overwing emergency exit located over the wing at approximately row 16-17. This is a hatch-type exit unique to narrow-body aircraft that opens by pulling inward and stowing.",
      "position": [-3, 42, 7],
      "interactionRadius": 1.5,
      "interactionText": "Examine the overwing exit. In an emergency, pull the handle, remove the hatch, and place it on the seats. Step onto the wing and slide down the trailing edge.",
      "educationTopicIds": ["emergency-exits", "overwing-evacuation", "737-exit-configuration"]
    },
    {
      "id": "overwing-exit-right",
      "name": "Right Overwing Emergency Exit",
      "category": "Door",
      "description": "The right overwing emergency exit, identical to the left overwing exit. The 737-800 has two pairs of overwing exits for a total of four overwing hatches.",
      "position": [3, 42, 7],
      "interactionRadius": 1.5,
      "interactionText": "Examine the overwing exit hatch. Extra legroom seats near these exits require passengers capable of operating the exit in an emergency.",
      "educationTopicIds": ["emergency-exits", "overwing-evacuation"]
    },
    {
      "id": "emergency-slide-fwd",
      "name": "Forward Evacuation Slide",
      "category": "EmergencyEquipment",
      "description": "An inflatable evacuation slide packed into the forward left door. When armed and the door is opened, the slide automatically deploys and inflates within 6 seconds.",
      "position": [-3, 12, 6],
      "interactionRadius": 1.5,
      "interactionText": "The evacuation slide is packed in a container attached to the door sill. When armed, opening the door pulls the inflation lanyard, deploying the slide in under 6 seconds.",
      "educationTopicIds": ["evacuation-slides", "emergency-equipment", "evacuation-procedures"]
    },
    {
      "id": "forward-galley-unit",
      "name": "Forward Galley Unit",
      "category": "Galley",
      "description": "The forward galley contains beverage carts, a coffee maker, ovens for heating meals, and storage for service items. Serves the forward cabin section.",
      "position": [0, 6, 7],
      "interactionRadius": 2.0,
      "interactionText": "Open the galley carts and compartments. The galley includes standard ATLAS containers, hot water boilers, and convection ovens for heating pre-prepared meals.",
      "educationTopicIds": ["galley-equipment", "cabin-service"]
    },
    {
      "id": "aft-galley-unit",
      "name": "Aft Galley Unit",
      "category": "Galley",
      "description": "The main aft galley serves the majority of economy class passengers. It is larger than the forward galley and contains more carts and storage.",
      "position": [1, 73, 7],
      "interactionRadius": 2.0,
      "interactionText": "The aft galley is the primary service point for economy class. Multiple beverage and meal carts are stored here between services.",
      "educationTopicIds": ["galley-equipment", "cabin-service"]
    },
    {
      "id": "overhead-bins",
      "name": "Overhead Storage Bins",
      "category": "OverheadBin",
      "description": "Pivot-style overhead bins run the length of the cabin on both sides, providing approximately 2.4 cubic feet of storage per passenger. The 737-800 Sky Interior bins are 48% larger than earlier models.",
      "position": [-2, 40, 9],
      "interactionRadius": 3.0,
      "interactionText": "Open the overhead bin by pressing the latch and pivoting the bin down. The Boeing Sky Interior bins can accommodate standard roller bags placed on their sides.",
      "educationTopicIds": ["cabin-interior-design", "sky-interior"]
    },
    {
      "id": "passenger-seats-row-1",
      "name": "Row 1 Passenger Seats",
      "category": "Seat",
      "description": "The first row of passenger seats, typically configured as business class or extra-legroom economy. Row 1 offers the most legroom in the forward cabin.",
      "position": [-2, 15, 7],
      "interactionRadius": 2.0,
      "interactionText": "Sit in a row 1 seat. Examine the seat belt, tray table in the armrest, overhead reading light, and passenger service unit with oxygen mask above.",
      "educationTopicIds": ["passenger-safety-equipment", "seat-design", "oxygen-system"]
    },
    {
      "id": "passenger-seats-forward-mid",
      "name": "Forward Economy Seats",
      "category": "Seat",
      "description": "Economy class seating in a 3-3 configuration, with seats labeled A through F. Standard seat pitch is 30-31 inches. Each seat has a fold-down tray table on the seatback ahead and a recline button on the armrest.",
      "position": [2, 26, 7],
      "interactionRadius": 2.0,
      "interactionText": "Sit in a forward economy seat. The 3-3 layout means seats A, B, C on the left and D, E, F on the right. Check the seat pocket, tray table, and overhead reading light.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment"]
    },
    {
      "id": "passenger-seats-mid-cabin",
      "name": "Mid Cabin Economy Seats",
      "category": "Seat",
      "description": "Economy seats in the mid cabin near the overwing emergency exits. Exit row seats offer significantly more legroom but the tray tables are in the armrests rather than on the seatback ahead. Window seats in the exit row may have a partially obstructed view due to the wing.",
      "position": [-2, 46, 7],
      "interactionRadius": 2.0,
      "interactionText": "Sit in a mid cabin seat near the overwing exits. Notice the extra legroom in exit rows. The emergency exit placards are illuminated and clearly visible. Window passengers can see the wing, flaps, and spoilers from here.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment", "emergency-exits"]
    },
    {
      "id": "passenger-seats-aft-cabin",
      "name": "Aft Cabin Economy Seats",
      "category": "Seat",
      "description": "Economy seats in the aft cabin section. These seats are closer to the engines and may experience more noise. The last few rows may have limited recline due to the rear bulkhead. Aft cabin passengers are typically last to deplane but first to receive meal service on some airlines.",
      "position": [2, 62, 7],
      "interactionRadius": 2.0,
      "interactionText": "Sit in an aft cabin seat. You can feel the proximity to the engines. The rear galley and lavatories are just behind. Check the seat belt, overhead bin, and passenger service unit.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment"]
    },
    {
      "id": "overhead-bins-fwd-left",
      "name": "Forward Cabin Left Overhead Bins",
      "category": "OverheadBin",
      "description": "Pivot-style overhead storage bins along the left side of the forward cabin, featuring the Boeing Sky Interior design with 48% more volume than earlier 737 models.",
      "position": [-2, 25, 9],
      "interactionRadius": 2.0,
      "interactionText": "Press the latch and pivot the bin down toward you. The Sky Interior bins accommodate standard roller bags placed on their sides. The bin closes with a satisfying click as the latch engages.",
      "educationTopicIds": ["cabin-interior-design", "sky-interior"]
    },
    {
      "id": "overhead-bins-fwd-right",
      "name": "Forward Cabin Right Overhead Bins",
      "category": "OverheadBin",
      "description": "Pivot-style overhead storage bins along the right side of the forward cabin, matching the left side in capacity and design.",
      "position": [2, 25, 9],
      "interactionRadius": 2.0,
      "interactionText": "Press the latch and pivot the starboard overhead bin down. These bins mirror the port side, offering the same generous Sky Interior storage volume for carry-on luggage.",
      "educationTopicIds": ["cabin-interior-design", "sky-interior"]
    },
    {
      "id": "overhead-bins-mid-left",
      "name": "Mid Cabin Left Overhead Bins",
      "category": "OverheadBin",
      "description": "Overhead storage bins along the left side of the mid cabin section, located above the overwing emergency exit rows.",
      "position": [-2, 46, 9],
      "interactionRadius": 2.0,
      "interactionText": "Open the mid cabin port-side overhead bin. Near the overwing exits, these bins may be slightly smaller to accommodate emergency lighting and exit signage above.",
      "educationTopicIds": ["cabin-interior-design", "sky-interior"]
    },
    {
      "id": "overhead-bins-mid-right",
      "name": "Mid Cabin Right Overhead Bins",
      "category": "OverheadBin",
      "description": "Overhead storage bins along the right side of the mid cabin, positioned above the starboard overwing exit area.",
      "position": [2, 46, 9],
      "interactionRadius": 2.0,
      "interactionText": "Open the starboard mid cabin overhead bin. The bin latches securely to prevent opening during turbulence. Emergency exit lighting runs along the bin rail.",
      "educationTopicIds": ["cabin-interior-design", "sky-interior"]
    },
    {
      "id": "overhead-bins-aft-left",
      "name": "Aft Cabin Left Overhead Bins",
      "category": "OverheadBin",
      "description": "Overhead storage bins along the left side of the aft cabin, serving the rear economy passengers.",
      "position": [-2, 62, 9],
      "interactionRadius": 2.0,
      "interactionText": "Open the aft cabin port-side overhead bin. Passengers in the rear of the aircraft often find more available bin space as the aft section boards last.",
      "educationTopicIds": ["cabin-interior-design", "sky-interior"]
    },
    {
      "id": "overhead-bins-aft-right",
      "name": "Aft Cabin Right Overhead Bins",
      "category": "OverheadBin",
      "description": "Overhead storage bins along the right side of the aft cabin, completing the continuous overhead storage throughout the passenger cabin.",
      "position": [2, 62, 9],
      "interactionRadius": 2.0,
      "interactionText": "Open the starboard aft cabin overhead bin. The last few bins before the aft bulkhead are popular with passengers who board early and stow bags near their seats.",
      "educationTopicIds": ["cabin-interior-design", "sky-interior"]
    },
    {
      "id": "pax-window-fwd-left",
      "name": "Forward Cabin Left Window",
      "category": "Window",
      "description": "A passenger window on the left side of the forward cabin. The triple-pane assembly provides structural integrity, thermal insulation, and a scratch-resistant inner surface.",
      "position": [-3, 25, 7],
      "interactionRadius": 1.0,
      "interactionText": "Look through the forward left window. From here you can see the airport terminal, ground equipment, and the nose of the aircraft ahead. The tiny breather hole in the middle pane equalizes pressure between layers.",
      "educationTopicIds": ["cabin-windows", "pressurization", "aircraft-structures"]
    },
    {
      "id": "pax-window-fwd-right",
      "name": "Forward Cabin Right Window",
      "category": "Window",
      "description": "A passenger window on the right side of the forward cabin, offering views of the airport and ramp area during ground operations.",
      "position": [3, 25, 7],
      "interactionRadius": 1.0,
      "interactionText": "Look through the forward right window. On the ground, you can see baggage carts, fuel trucks, and other aircraft at adjacent gates. The window shade slides up and down for light control.",
      "educationTopicIds": ["cabin-windows", "pressurization", "aircraft-structures"]
    },
    {
      "id": "pax-window-mid-left",
      "name": "Mid Cabin Left Window",
      "category": "Window",
      "description": "A passenger window on the left side of the mid cabin, positioned over the wing with views of the engine, leading edge slats, and trailing edge flaps.",
      "position": [-3, 46, 7],
      "interactionRadius": 1.0,
      "interactionText": "Look through the mid cabin left window. The wing stretches out below with the CFM56 engine visible on its pylon. Watch the slats and flaps deploy during takeoff and landing configuration changes.",
      "educationTopicIds": ["cabin-windows", "pressurization", "aircraft-structures"]
    },
    {
      "id": "pax-window-mid-right",
      "name": "Mid Cabin Right Window",
      "category": "Window",
      "description": "A passenger window on the right side of the mid cabin over the starboard wing, offering symmetrical views of the wing and engine.",
      "position": [3, 46, 7],
      "interactionRadius": 1.0,
      "interactionText": "Look through the mid cabin right window. The starboard wing and engine are visible below. During flight, you can watch the spoilers rise on landing and the ailerons deflect in turns.",
      "educationTopicIds": ["cabin-windows", "pressurization", "aircraft-structures"]
    },
    {
      "id": "pax-window-aft-left",
      "name": "Aft Cabin Left Window",
      "category": "Window",
      "description": "A passenger window on the left side of the aft cabin, offering views behind the wing trailing edge toward the tail and ground below.",
      "position": [-3, 62, 7],
      "interactionRadius": 1.0,
      "interactionText": "Look through the aft cabin left window. Behind the wing, you can see the ground below and the horizontal stabilizer at the tail. During approach, the runway appears to slide beneath you.",
      "educationTopicIds": ["cabin-windows", "pressurization", "aircraft-structures"]
    },
    {
      "id": "pax-window-aft-right",
      "name": "Aft Cabin Right Window",
      "category": "Window",
      "description": "A passenger window on the right side of the aft cabin with views of the tail section and ground below during flight.",
      "position": [3, 62, 7],
      "interactionRadius": 1.0,
      "interactionText": "Look through the aft cabin right window. You can see the vertical stabilizer rising above the tail and the ground stretching out behind the aircraft. The engine exhaust shimmer is sometimes visible.",
      "educationTopicIds": ["cabin-windows", "pressurization", "aircraft-structures"]
    },
    {
      "id": "exit-row-seats-left",
      "name": "Left Exit Row Seats",
      "category": "Seat",
      "description": "Exit row seats on the left side adjacent to the overwing emergency exit. These seats offer significantly more legroom than standard economy but come with the responsibility of assisting in an emergency evacuation.",
      "position": [-2, 42, 7],
      "interactionRadius": 1.5,
      "interactionText": "Sit in the left exit row seat. Notice the extra legroom ahead of you where the overwing exit hatch is located. The tray table folds out from the armrest instead of the seatback. The safety briefing card shows how to operate the exit.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment", "emergency-exits"]
    },
    {
      "id": "exit-row-seats-right",
      "name": "Right Exit Row Seats",
      "category": "Seat",
      "description": "Exit row seats on the right side adjacent to the overwing emergency exit, matching the left side in extra legroom and evacuation responsibilities.",
      "position": [2, 42, 7],
      "interactionRadius": 1.5,
      "interactionText": "Sit in the right exit row seat. The extra space ahead gives ample legroom. Passengers seated here must confirm they are willing and able to assist with emergency evacuation if needed.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment", "emergency-exits"]
    },
    {
      "id": "window-seat-fwd-left",
      "name": "Forward Left Window Seat",
      "category": "Seat",
      "description": "A window seat on the left side of the forward cabin, offering views of the airport during ground operations and the landscape during flight.",
      "position": [-3, 20, 7],
      "interactionRadius": 1.5,
      "interactionText": "Sit in the left window seat. Lean against the fuselage wall and look out at the airport. The window shade gives you control over light and views. The seat is slightly narrower than the aisle seat due to the fuselage curvature.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment"]
    },
    {
      "id": "window-seat-fwd-right",
      "name": "Forward Right Window Seat",
      "category": "Seat",
      "description": "A window seat on the right side of the forward cabin, positioned at seat F with direct access to the window shade and fuselage wall for leaning.",
      "position": [3, 20, 7],
      "interactionRadius": 1.5,
      "interactionText": "Sit in the right window seat. You have a direct view outside and can rest against the cabin wall. The reading light above can be directed onto your lap without disturbing neighboring passengers.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment"]
    },
    {
      "id": "aisle-seat-mid-left",
      "name": "Mid Cabin Left Aisle Seat",
      "category": "Seat",
      "description": "An aisle seat on the left side of the mid cabin at seat C, offering easy access to the aisle for stretching and lavatory visits without disturbing other passengers.",
      "position": [-1, 50, 7],
      "interactionRadius": 1.5,
      "interactionText": "Sit in the left aisle seat. You can easily step into the aisle without climbing over neighbors. The armrest on the aisle side lifts up for easier entry and exit. Watch for the beverage cart coming through.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment"]
    },
    {
      "id": "aisle-seat-mid-right",
      "name": "Mid Cabin Right Aisle Seat",
      "category": "Seat",
      "description": "An aisle seat on the right side of the mid cabin at seat D, the mirror of seat C with identical aisle access convenience.",
      "position": [1, 50, 7],
      "interactionRadius": 1.5,
      "interactionText": "Sit in the right aisle seat. Direct aisle access makes this a popular choice for frequent flyers. The overhead bin is easily reachable from here. Keep your elbow tucked in when the cart passes.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment"]
    },
    {
      "id": "last-row-seats-left",
      "name": "Last Row Left Seats",
      "category": "Seat",
      "description": "The last row of seats on the left side of the aft cabin, directly against the rear bulkhead. These seats have limited or no recline and are close to the aft galley and lavatories.",
      "position": [-2, 68, 7],
      "interactionRadius": 1.5,
      "interactionText": "Sit in the last row. The seat recline is limited by the bulkhead behind you. You can hear the galley activity and lavatory doors. On the plus side, you are first to be served meals from the aft galley.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment"]
    },
    {
      "id": "last-row-seats-right",
      "name": "Last Row Right Seats",
      "category": "Seat",
      "description": "The last row of seats on the right side of the aft cabin, adjacent to the rear bulkhead with limited recline. Proximity to the aft galley means quick meal service but also galley noise.",
      "position": [2, 68, 7],
      "interactionRadius": 1.5,
      "interactionText": "Sit in the last row on the right. The seat barely reclines due to the bulkhead. Galley sounds and lavatory traffic are constant companions, but you will be among the first served during meal service.",
      "educationTopicIds": ["seat-design", "passenger-safety-equipment"]
    },
    {
      "id": "pax-window",
      "name": "Passenger Cabin Window",
      "category": "Window",
      "description": "Standard 737 cabin windows measure approximately 10.3 by 14.2 inches. Each window assembly consists of an outer structural pane, an inner pane, and a scratch pane with a sliding shade.",
      "position": [-3, 25, 7],
      "interactionRadius": 1.0,
      "interactionText": "Look through the triple-layer cabin window. The tiny hole in the middle pane equalizes pressure between the panes and prevents fogging.",
      "educationTopicIds": ["cabin-windows", "pressurization", "aircraft-structures"]
    },
    {
      "id": "fwd-cargo-containers",
      "name": "Forward Cargo Containers",
      "category": "CargoEquipment",
      "description": "LD3-45 cargo containers stacked on loading rails in the forward cargo hold. These half-width containers are specifically designed for narrow-body aircraft like the 737, each holding up to 1,500 lbs of baggage or freight.",
      "position": [0, 22, 3],
      "interactionRadius": 2.0,
      "interactionText": "Examine the LD3-45 containers secured on the cargo loading rails. Each aluminum container is contoured to fit the lower fuselage shape. Ground crews slide them along the powered roller system during loading.",
      "educationTopicIds": ["cargo-hold-operations", "cargo-container-types", "cargo-door-systems"]
    },
    {
      "id": "fwd-cargo-net",
      "name": "Forward Cargo Restraint Net",
      "category": "CargoEquipment",
      "description": "A heavy-duty cargo net and barrier system in the forward cargo hold that prevents load shifting during flight. The nets are rated to withstand 9g forward loads per FAA certification requirements.",
      "position": [0, 26, 4],
      "interactionRadius": 1.5,
      "interactionText": "Inspect the cargo restraint net stretched across the hold. The woven nylon barrier clips to floor-mounted fittings and prevents cargo from shifting during turbulence or emergency maneuvers.",
      "educationTopicIds": ["cargo-hold-operations", "cargo-container-types", "cargo-door-systems"]
    },
    {
      "id": "fwd-cargo-door",
      "name": "Forward Cargo Door Mechanism",
      "category": "CargoEquipment",
      "description": "The powered forward cargo door on the starboard side of the fuselage. The door is electrically actuated and features multiple locking mechanisms and a pressure seal to maintain cabin pressurization.",
      "position": [2, 18, 3],
      "interactionRadius": 1.5,
      "interactionText": "Examine the forward cargo door mechanism. The door lifts upward on powered actuators. Multiple lock pins engage sequentially, and a pressure seal inflates around the door frame to maintain pressurization.",
      "educationTopicIds": ["cargo-hold-operations", "cargo-container-types", "cargo-door-systems"]
    },
    {
      "id": "aft-cargo-containers",
      "name": "Aft Cargo Containers",
      "category": "CargoEquipment",
      "description": "LD3-45 cargo containers and bulk-loaded baggage in the aft cargo hold. This compartment typically carries checked passenger baggage and additional freight.",
      "position": [0, 62, 3],
      "interactionRadius": 2.0,
      "interactionText": "Examine the aft cargo containers on their loading rails. Passenger checked bags are typically loaded here, with fragile and priority items placed last for first off-loading at the destination.",
      "educationTopicIds": ["cargo-hold-operations", "cargo-container-types", "cargo-door-systems"]
    },
    {
      "id": "aft-cargo-net",
      "name": "Aft Cargo Restraint Net",
      "category": "CargoEquipment",
      "description": "Cargo barrier and restraint netting in the aft cargo hold, securing loose baggage and preventing load shift that could affect the aircraft's center of gravity.",
      "position": [0, 65, 4],
      "interactionRadius": 1.5,
      "interactionText": "Inspect the aft cargo net. Proper cargo restraint is critical for maintaining the aircraft's weight and balance within safe limits throughout the flight.",
      "educationTopicIds": ["cargo-hold-operations", "cargo-container-types", "cargo-door-systems"]
    },
    {
      "id": "aft-cargo-door",
      "name": "Aft Cargo Door Mechanism",
      "category": "CargoEquipment",
      "description": "The powered aft cargo door on the starboard side, providing access to the aft cargo hold. Features the same multi-lock and pressure seal design as the forward cargo door.",
      "position": [2, 59, 3],
      "interactionRadius": 1.5,
      "interactionText": "Examine the aft cargo door. Like the forward door, it lifts upward with powered actuators. Safety interlocks prevent the door from being opened when the cabin is pressurized.",
      "educationTopicIds": ["cargo-hold-operations", "cargo-container-types", "cargo-door-systems"]
    },
    {
      "id": "left-engine",
      "name": "Left CFM56-7B26 Engine",
      "category": "Engine",
      "description": "The left CFM56-7B26 turbofan engine produces up to 27,300 lbs of thrust. The CFM56-7B is a high-bypass ratio turbofan jointly manufactured by CFM International (GE and Safran).",
      "position": [-16, 36, 3],
      "interactionRadius": 3.0,
      "interactionText": "Examine the CFM56-7B engine. Note the flat-bottomed nacelle unique to the 737 for ground clearance. The engine has a 61-inch fan with 24 blades and a bypass ratio of 5.1:1.",
      "educationTopicIds": ["cfm56-engine", "turbofan-principles", "engine-components", "bypass-ratio"],
      "interactionSteps": [
        "The engine is cold and silent. You can hear the wind whistling across the inlet cowling.",
        "The starter motor engages with a rising whine. The N2 core spool begins to rotate, building from a low whir to a steady hum.",
        "Fuel is introduced to the combustion chamber. You hear a muffled ignition whoosh as the burner cans light off.",
        "The engine accelerates to idle. The fan picks up speed with a deep whooshing sound, pushing a steady stream of warm exhaust air backward. N1 stabilizes at idle.",
        "Engine running at ground idle. A low rumble and steady vibration. The fan blades spin in a blur, drawing air through the distinctive flat-bottomed CFM56 nacelle."
      ]
    },
    {
      "id": "right-engine",
      "name": "Right CFM56-7B26 Engine",
      "category": "Engine",
      "description": "The right CFM56-7B26 turbofan engine, identical to the left engine. Both engines are monitored through the EICAS display in the cockpit.",
      "position": [16, 36, 3],
      "interactionRadius": 3.0,
      "interactionText": "Examine the right engine nacelle. The thrust reverser uses a cascade-type system that redirects exhaust forward to help slow the aircraft after landing.",
      "educationTopicIds": ["cfm56-engine", "thrust-reversers", "engine-maintenance"],
      "interactionSteps": [
        "The engine is cold and silent. You can hear the wind whistling across the inlet cowling.",
        "The starter motor engages with a rising whine. The N2 core spool begins to rotate, building from a low whir to a steady hum.",
        "Fuel is introduced to the combustion chamber. You hear a muffled ignition whoosh as the burner cans light off.",
        "The engine accelerates to idle. The fan picks up speed with a deep whooshing sound, pushing a steady stream of warm exhaust air backward. N1 stabilizes at idle.",
        "Engine running at ground idle. A low rumble and steady vibration. The fan blades spin in a blur, drawing air through the distinctive flat-bottomed CFM56 nacelle."
      ]
    },
    {
      "id": "nose-gear-assembly",
      "name": "Nose Landing Gear Assembly",
      "category": "LandingGear",
      "description": "The nose gear features dual wheels and is steerable up to 78 degrees for ground maneuvering. It retracts forward into the nose wheel well and uses a hydraulic shimmy damper.",
      "position": [0, 10, 1],
      "interactionRadius": 2.0,
      "interactionText": "Inspect the nose landing gear. The dual wheels are steerable for taxiing and use oleo-pneumatic shock absorbers. Note the gear door actuators and retraction mechanism.",
      "educationTopicIds": ["landing-gear-systems", "nose-wheel-steering", "oleo-strut"],
      "interactionSteps": [
        "The nose landing gear is extended and locked. Two tires sit on the ground, the oleo strut compressed under the aircraft's nose weight.",
        "Gear retraction begins. Hydraulic actuators push the nose gear forward and upward as the gear doors swing open.",
        "The nose gear folds forward into the wheel well beneath the cockpit floor. The doors close behind it, restoring the aerodynamic profile. Two green lights extinguish on the gear indicator."
      ]
    },
    {
      "id": "left-main-gear",
      "name": "Left Main Landing Gear",
      "category": "LandingGear",
      "description": "The left main gear is a dual-wheel unit with carbon brakes. It retracts inward into the wing root area and supports the majority of the aircraft's weight during ground operations.",
      "position": [-5, 40, 1],
      "interactionRadius": 2.0,
      "interactionText": "Inspect the left main gear. Each tire is rated for the aircraft's maximum landing weight. The carbon brakes can absorb enormous energy during a rejected takeoff.",
      "educationTopicIds": ["landing-gear-systems", "braking-systems", "carbon-brakes"],
      "interactionSteps": [
        "The main landing gear stands firm with two wheels per assembly. The oleo strut absorbs the aircraft's weight, compressed about halfway.",
        "Gear retraction initiated. The main gear begins retracting inward toward the wing root, the wheels rotating to fit into the wheel well.",
        "The main gear is up and locked. The wheel well doors close, creating a smooth underside. Green gear-down lights have been replaced by red in-transit and then off."
      ]
    },
    {
      "id": "right-main-gear",
      "name": "Right Main Landing Gear",
      "category": "LandingGear",
      "description": "The right main gear is identical to the left main gear. Together, the two main gear assemblies bear approximately 95% of the aircraft's weight on the ground.",
      "position": [5, 40, 1],
      "interactionRadius": 2.0,
      "interactionText": "Inspect the right main gear. The anti-skid braking system prevents wheel lockup and optimizes braking performance on all runway surfaces.",
      "educationTopicIds": ["landing-gear-systems", "anti-skid-system"],
      "interactionSteps": [
        "The main landing gear stands firm with two wheels per assembly. The oleo strut absorbs the aircraft's weight, compressed about halfway.",
        "Gear retraction initiated. The main gear begins retracting inward toward the wing root, the wheels rotating to fit into the wheel well.",
        "The main gear is up and locked. The wheel well doors close, creating a smooth underside. Green gear-down lights have been replaced by red in-transit and then off."
      ]
    },
    {
      "id": "left-aileron",
      "name": "Left Aileron",
      "category": "ControlSurface",
      "description": "The left outboard aileron on the trailing edge of the left wing. The 737 uses a single aileron per wing, assisted by flight spoilers for roll control at higher speeds.",
      "position": [-30, 45, 6],
      "interactionRadius": 2.0,
      "interactionText": "Examine the left aileron. It deflects upward when the yoke is turned left, reducing lift on the left wing and causing the aircraft to roll left.",
      "educationTopicIds": ["how-ailerons-work", "roll-control", "flight-controls-overview"]
    },
    {
      "id": "right-aileron",
      "name": "Right Aileron",
      "category": "ControlSurface",
      "description": "The right outboard aileron on the trailing edge of the right wing. Works in opposition to the left aileron to create differential lift for roll control.",
      "position": [30, 45, 6],
      "interactionRadius": 2.0,
      "interactionText": "Examine the right aileron. When the left aileron goes up, the right aileron deflects downward, increasing lift on the right wing to roll the aircraft left.",
      "educationTopicIds": ["how-ailerons-work", "roll-control"]
    },
    {
      "id": "left-flap",
      "name": "Left Trailing Edge Flaps",
      "category": "ControlSurface",
      "description": "The left wing double-slotted trailing edge flaps extend and lower to increase wing camber and area, generating more lift at lower speeds for takeoff and landing.",
      "position": [-15, 48, 5],
      "interactionRadius": 2.5,
      "interactionText": "Observe the double-slotted Fowler flaps. They extend rearward and downward in settings of 1, 2, 5, 10, 15, 25, 30, and 40 degrees for various phases of flight.",
      "educationTopicIds": ["how-flaps-work", "high-lift-devices", "takeoff-configuration"],
      "interactionSteps": [
        "Flaps are fully retracted, flush with the wing trailing edge. The clean wing configuration is optimized for cruise speed.",
        "Flaps 1. The leading edge slats extend and the trailing edge flaps move to 1 degree. A hydraulic whirring sound accompanies the movement.",
        "Flaps 5. The trailing edge flaps extend further. You can see gaps forming between the wing and flap sections as the slotted Fowler mechanism activates.",
        "Flaps 15. The flaps are now clearly extended, increasing the wing's curvature. Air flowing through the slots adds energy to the upper surface boundary layer.",
        "Flaps 30. Near maximum extension for a typical landing. The wing area is significantly larger, generating much more lift at low speed, but also much more drag.",
        "Flaps 40. Full extension. The flaps are fully deployed creating maximum lift and drag for a short-field landing approach."
      ]
    },
    {
      "id": "right-flap",
      "name": "Right Trailing Edge Flaps",
      "category": "ControlSurface",
      "description": "The right wing double-slotted trailing edge flaps, identical to the left side. Both sides deploy symmetrically to maintain balanced lift during configuration changes.",
      "position": [15, 48, 5],
      "interactionRadius": 2.5,
      "interactionText": "Watch the flaps extend on rails, moving aft and down. The double-slotted design creates a gap that energizes airflow over the flap surface for greater lift.",
      "educationTopicIds": ["how-flaps-work", "high-lift-devices"],
      "interactionSteps": [
        "Flaps are fully retracted, flush with the wing trailing edge. The clean wing configuration is optimized for cruise speed.",
        "Flaps 1. The leading edge slats extend and the trailing edge flaps move to 1 degree. A hydraulic whirring sound accompanies the movement.",
        "Flaps 5. The trailing edge flaps extend further. You can see gaps forming between the wing and flap sections as the slotted Fowler mechanism activates.",
        "Flaps 15. The flaps are now clearly extended, increasing the wing's curvature. Air flowing through the slots adds energy to the upper surface boundary layer.",
        "Flaps 30. Near maximum extension for a typical landing. The wing area is significantly larger, generating much more lift at low speed, but also much more drag.",
        "Flaps 40. Full extension. The flaps are fully deployed creating maximum lift and drag for a short-field landing approach."
      ]
    },
    {
      "id": "left-slat",
      "name": "Left Leading Edge Slats",
      "category": "ControlSurface",
      "description": "Leading edge slats on the left wing extend forward and down from the wing leading edge, increasing the wing's effective camber and delaying stall to higher angles of attack.",
      "position": [-20, 34, 7],
      "interactionRadius": 2.5,
      "interactionText": "Examine the leading edge slats. They deploy automatically with flap extension, creating a slot that allows high-energy air to flow over the upper wing surface.",
      "educationTopicIds": ["leading-edge-devices", "stall-prevention", "high-lift-devices"],
      "interactionSteps": [
        "Slats are sealed against the wing leading edge in the retracted position, forming a smooth aerodynamic surface.",
        "The slats begin to extend forward and downward on their tracks. You can hear the hydraulic actuators driving them out.",
        "Slats are fully extended. A gap has opened between the slat and the main wing, allowing high-energy air from below to flow over the upper wing surface, preventing stall at high angles of attack."
      ]
    },
    {
      "id": "right-slat",
      "name": "Right Leading Edge Slats",
      "category": "ControlSurface",
      "description": "Leading edge slats on the right wing, operating symmetrically with the left slats. The 737 has both sealed and slotted slat sections.",
      "position": [20, 34, 7],
      "interactionRadius": 2.5,
      "interactionText": "The right leading edge slats deploy in concert with the left side. The sealed inboard sections and slotted outboard sections work together to delay stall.",
      "educationTopicIds": ["leading-edge-devices", "stall-prevention"],
      "interactionSteps": [
        "Slats are sealed against the wing leading edge in the retracted position, forming a smooth aerodynamic surface.",
        "The slats begin to extend forward and downward on their tracks. You can hear the hydraulic actuators driving them out.",
        "Slats are fully extended. A gap has opened between the slat and the main wing, allowing high-energy air from below to flow over the upper wing surface, preventing stall at high angles of attack."
      ]
    },
    {
      "id": "elevator",
      "name": "Elevator",
      "category": "ControlSurface",
      "description": "The elevators are hinged to the trailing edge of the horizontal stabilizer and control aircraft pitch. The 737 uses a conventional elevator with a trimmable horizontal stabilizer.",
      "position": [0, 77, 11],
      "interactionRadius": 2.5,
      "interactionText": "Examine the elevator surfaces. When the yoke is pulled back, the elevators deflect upward, pushing the tail down and the nose up. The stabilizer trim adjusts the neutral position.",
      "educationTopicIds": ["how-elevators-work", "pitch-control", "stabilizer-trim"]
    },
    {
      "id": "rudder",
      "name": "Rudder",
      "category": "ControlSurface",
      "description": "The rudder is hinged to the trailing edge of the vertical stabilizer and controls yaw. The 737's rudder uses a dual-actuator system following the rudder hardover investigations.",
      "position": [0, 77, 18],
      "interactionRadius": 2.5,
      "interactionText": "Examine the rudder. It deflects left or right to yaw the aircraft. The 737 rudder has a standby hydraulic actuator and a yaw damper for Dutch roll suppression.",
      "educationTopicIds": ["how-rudder-works", "yaw-control", "dutch-roll", "rudder-system-safety"]
    },
    {
      "id": "spoilers",
      "name": "Wing Spoilers / Speed Brakes",
      "category": "ControlSurface",
      "description": "The 737-800 has multiple spoiler panels on each wing upper surface. They serve as speed brakes in flight, ground spoilers after landing, and assist ailerons in roll control.",
      "position": [-10, 42, 7],
      "interactionRadius": 2.5,
      "interactionText": "Observe the spoiler panels on the wing upper surface. In flight, they deploy symmetrically as speed brakes. On the ground, all panels deploy fully to destroy lift and improve braking.",
      "educationTopicIds": ["spoiler-systems", "speed-brakes", "ground-spoilers", "roll-augmentation"],
      "interactionSteps": [
        "Spoiler panels lie flush with the upper wing surface, barely visible among the wing skin panels.",
        "Speed brakes armed. On touchdown, the ground spoilers will deploy automatically.",
        "Ground spoilers deploy! All panels snap upward simultaneously, disrupting airflow across the entire upper wing. Lift is instantly destroyed, pressing the wheels firmly onto the runway.",
        "Maximum braking. With the spoilers fully raised, the wheels carry the aircraft's full weight, making the brakes maximally effective. The aircraft decelerates rapidly."
      ]
    },
    {
      "id": "pitot-tubes",
      "name": "Pitot Tubes",
      "category": "Avionics",
      "description": "Three pitot tubes mounted on the forward fuselage measure ram air pressure to determine airspeed. The 737 has captain, first officer, and standby pitot systems for redundancy.",
      "position": [-2, 4, 6],
      "interactionRadius": 1.5,
      "interactionText": "Examine the heated pitot tubes. They measure the total pressure of incoming air to calculate indicated airspeed. Heaters prevent ice blockage in flight.",
      "educationTopicIds": ["pitot-static-system", "airspeed-measurement", "icing-protection"]
    },
    {
      "id": "static-ports",
      "name": "Static Ports",
      "category": "Avionics",
      "description": "Static ports on both sides of the fuselage measure ambient atmospheric pressure for altitude, airspeed, and vertical speed calculations. Dual ports prevent errors from sideslip.",
      "position": [3, 10, 6],
      "interactionRadius": 1.0,
      "interactionText": "Locate the flush-mounted static ports on the fuselage skin. They measure undisturbed atmospheric pressure for the altimeter, airspeed indicator, and vertical speed indicator.",
      "educationTopicIds": ["pitot-static-system", "altimetry", "pressure-instruments"]
    },
    {
      "id": "apu-exhaust",
      "name": "APU Exhaust",
      "category": "APU",
      "description": "The APU exhaust outlet at the tail cone of the aircraft. The Honeywell 131-9B APU provides 90 kVA of electrical power and bleed air at up to 40 psi.",
      "position": [0, 79, 5],
      "interactionRadius": 1.5,
      "interactionText": "Examine the APU exhaust pipe at the aircraft tail. The APU is started before the main engines to provide electrical power and bleed air for engine starting and air conditioning on the ground.",
      "educationTopicIds": ["apu-operations", "ground-power", "bleed-air-system"],
      "interactionSteps": [
        "The APU exhaust port at the tail cone is silent and cold.",
        "APU start initiated from the overhead panel. The starter motor spins up the small gas turbine with a high-pitched whine.",
        "The APU ignites and accelerates to operating speed. You hear a steady high-pitched hum from the tail. The APU generator comes online, providing electrical power.",
        "APU bleed air valve opens. Pneumatic pressure is now available for air conditioning and engine starting. The APU is running at full capacity."
      ]
    },
    {
      "id": "weather-radar",
      "name": "Weather Radar Antenna",
      "category": "Avionics",
      "description": "The Collins WXR-2100 MultiScan weather radar is housed in the nose radome. It automatically adjusts tilt and gain to detect weather at multiple altitudes ahead of the aircraft.",
      "position": [0, 1, 4],
      "interactionRadius": 2.0,
      "interactionText": "Examine the weather radar antenna behind the radome. The MultiScan radar simultaneously scans at different tilt angles to detect storms at various distances and altitudes.",
      "educationTopicIds": ["weather-radar", "thunderstorm-avoidance", "radome-design"]
    }
  ],
  "controlSurfaces": [
    {
      "id": "cs-ailerons",
      "name": "Ailerons",
      "axis": "roll",
      "movementDescription": "Yoke turned left: left aileron deflects upward, right aileron deflects downward. Yoke turned right: opposite deflection.",
      "flightEffect": "Differential lift between wings causes the aircraft to roll. Left yoke input rolls the aircraft left, banking the wings and initiating a turn to the left.",
      "componentId": "left-aileron"
    },
    {
      "id": "cs-elevator",
      "name": "Elevator",
      "axis": "pitch",
      "movementDescription": "Yoke pulled back: elevators deflect upward. Yoke pushed forward: elevators deflect downward.",
      "flightEffect": "Upward elevator deflection creates a downward aerodynamic force on the tail, pitching the nose up. This increases angle of attack and causes the aircraft to climb. Forward yoke pitches the nose down.",
      "componentId": "elevator"
    },
    {
      "id": "cs-rudder",
      "name": "Rudder",
      "axis": "yaw",
      "movementDescription": "Left rudder pedal pressed: rudder deflects to the left. Right rudder pedal pressed: rudder deflects to the right.",
      "flightEffect": "Rudder deflection creates a lateral aerodynamic force on the vertical stabilizer, yawing the aircraft nose in the direction of the deflection. Used for coordinated turns, crosswind correction, and asymmetric thrust situations.",
      "componentId": "rudder"
    },
    {
      "id": "cs-flaps",
      "name": "Trailing Edge Flaps",
      "axis": "pitch",
      "movementDescription": "Flap lever moved from UP through detents 1, 2, 5, 10, 15, 25, 30, 40. Flaps extend rearward and downward progressively.",
      "flightEffect": "Extending flaps increases wing camber and area, generating more lift at lower speeds. This reduces takeoff and landing speeds but increases drag. Higher flap settings produce more drag for steeper approach angles.",
      "componentId": "left-flap"
    },
    {
      "id": "cs-slats",
      "name": "Leading Edge Slats",
      "axis": "pitch",
      "movementDescription": "Slats extend automatically with flap selection. At flaps 1, leading edge devices deploy. Full extension at higher flap settings.",
      "flightEffect": "Extended slats increase the wing's maximum angle of attack before stall by energizing airflow over the upper wing surface. This allows the aircraft to fly safely at lower speeds during takeoff and landing.",
      "componentId": "left-slat"
    },
    {
      "id": "cs-spoilers",
      "name": "Spoilers / Speed Brakes",
      "axis": "roll",
      "movementDescription": "Speed brake lever raised: spoiler panels deploy symmetrically on both wings. During roll, flight spoilers deploy asymmetrically to assist ailerons.",
      "flightEffect": "Symmetric spoiler deployment disrupts airflow over the wing upper surface, reducing lift and increasing drag. Used to increase descent rate without gaining speed. On the ground, full deployment destroys remaining lift for maximum braking effectiveness.",
      "componentId": "spoilers"
    },
    {
      "id": "cs-stabilizer-trim",
      "name": "Horizontal Stabilizer Trim",
      "axis": "pitch",
      "movementDescription": "Trim switches on yoke or trim wheel on center pedestal rotate the entire horizontal stabilizer angle. Nose-up trim tilts the leading edge of the stabilizer up.",
      "flightEffect": "Adjusting stabilizer trim changes the neutral pitch position of the aircraft, relieving continuous control column pressure. Essential for maintaining trimmed flight as speed, configuration, and center of gravity change.",
      "componentId": "elevator"
    }
  ]
}